service/validateservice-ws/src/test/resources/dk/dbc/validateservice/ws/wrong_record_packing.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://oss.dbc.dk/ns/openCatalogingValidate/20140306" xmlns:ns1="http://oss.dbc.dk/ns/openCataloging/DataContracts/20140306">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:validate>
            <ns:validationRequest>
                <ns1:validateSchema>bog</ns1:validateSchema>
                <ns1:bibliographicalRecord>
                    <ns1:recordSchema>info:lc/xmlns/marcxchange-v1</ns1:recordSchema>
                    <ns1:recordPacking>string</ns1:recordPacking>
                    <ns1:recordData>
                        &lt;sru:collection
                            xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
                            xmlns:sru='info:lc/xmlns/marcxchange-v2'
                            xsi:schemaLocation='info:lc/xmlns/marcxchange-v2 http://www.loc.gov/standards/iso25577/marcxchange-2-0.xsd'&gt;
                            &lt;sru:record&gt;
                                &lt;sru:datafield tag="001"&gt;
                                    &lt;sru:subfield code="a"&gt;1 234 567 8&lt;/sru:subfield&gt;
                                    &lt;sru:subfield code="b"&gt;870970&lt;/sru:subfield&gt;
                                    &lt;sru:subfield code="c"&gt;12072013&lt;/sru:subfield&gt;
                                    &lt;sru:subfield code="d"&gt;12072013101735&lt;/sru:subfield&gt;
                                    &lt;sru:subfield code="f"&gt;a&lt;/sru:subfield&gt;
                                &lt;/sru:datafield&gt;
                                &lt;sru:datafield tag="004"&gt;
                                    &lt;sru:subfield code="a"&gt;e&lt;/sru:subfield&gt;
                                    &lt;sru:subfield code="r"&gt;n&lt;/sru:subfield&gt;
                                &lt;/sru:datafield&gt;
                            &lt;/sru:record&gt;
                        &lt;/sru:collection&gt;
                    </ns1:recordData>
                    <!--Optional:-->
                    <ns1:extraRecordData>
                       cum
                       <!--You may enter ANY elements at this point-->
                       sonoras
                    </ns1:extraRecordData>
                </ns1:bibliographicalRecord>
            </ns:validationRequest>
        </ns:validate>
    </soapenv:Body>
</soapenv:Envelope>
